# pokedex.py (Auto-generated)

SPRITES = {
    # 아스키 아트는 별도로 채워넣으세요
}

POKEMON_DB = {
    "1": {
        "name": "이상해씨",
        "type": "풀",
        "hp": 45,
        "atk": 49,
        "def": 49,
        "spd": 45,
        "moves": [
            [
                "칼바람",
                80,
                "노말"
            ],
            [
                "칼춤",
                0,
                "노말"
            ],
            [
                "풀베기",
                50,
                "노말"
            ],
            [
                "조이기",
                15,
                "노말"
            ]
        ]
    },
    "2": {
        "name": "이상해풀",
        "type": "풀",
        "hp": 60,
        "atk": 62,
        "def": 63,
        "spd": 60,
        "moves": [
            [
                "칼춤",
                0,
                "노말"
            ],
            [
                "풀베기",
                50,
                "노말"
            ],
            [
                "조이기",
                15,
                "노말"
            ],
            [
                "덩굴채찍",
                45,
                "풀"
            ]
        ]
    },
    "3": {
        "name": "이상해꽃",
        "type": "풀",
        "hp": 80,
        "atk": 82,
        "def": 83,
        "spd": 80,
        "moves": [
            [
                "칼춤",
                0,
                "노말"
            ],
            [
                "풀베기",
                50,
                "노말"
            ],
            [
                "조이기",
                15,
                "노말"
            ],
            [
                "덩굴채찍",
                45,
                "풀"
            ]
        ]
    },
    "4": {
        "name": "파이리",
        "type": "불꽃",
        "hp": 39,
        "atk": 52,
        "def": 43,
        "spd": 65,
        "moves": [
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "불꽃펀치",
                75,
                "불꽃"
            ],
            [
                "번개펀치",
                75,
                "전기"
            ],
            [
                "할퀴기",
                40,
                "노말"
            ]
        ]
    },
    "5": {
        "name": "리자드",
        "type": "불꽃",
        "hp": 58,
        "atk": 64,
        "def": 58,
        "spd": 80,
        "moves": [
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "불꽃펀치",
                75,
                "불꽃"
            ],
            [
                "번개펀치",
                75,
                "전기"
            ],
            [
                "할퀴기",
                40,
                "노말"
            ]
        ]
    },
    "6": {
        "name": "리자몽",
        "type": "불꽃",
        "hp": 78,
        "atk": 84,
        "def": 78,
        "spd": 100,
        "moves": [
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "불꽃펀치",
                75,
                "불꽃"
            ],
            [
                "번개펀치",
                75,
                "전기"
            ],
            [
                "할퀴기",
                40,
                "노말"
            ]
        ]
    },
    "7": {
        "name": "꼬부기",
        "type": "물",
        "hp": 44,
        "atk": 48,
        "def": 65,
        "spd": 43,
        "moves": [
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "냉동펀치",
                75,
                "얼음"
            ],
            [
                "메가톤킥",
                120,
                "노말"
            ],
            [
                "박치기",
                70,
                "노말"
            ]
        ]
    },
    "8": {
        "name": "어니부기",
        "type": "물",
        "hp": 59,
        "atk": 63,
        "def": 80,
        "spd": 58,
        "moves": [
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "냉동펀치",
                75,
                "얼음"
            ],
            [
                "메가톤킥",
                120,
                "노말"
            ],
            [
                "박치기",
                70,
                "노말"
            ]
        ]
    },
    "9": {
        "name": "거북왕",
        "type": "물",
        "hp": 79,
        "atk": 83,
        "def": 100,
        "spd": 78,
        "moves": [
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "냉동펀치",
                75,
                "얼음"
            ],
            [
                "메가톤킥",
                120,
                "노말"
            ],
            [
                "박치기",
                70,
                "노말"
            ]
        ]
    },
    "10": {
        "name": "캐터피",
        "type": "벌레",
        "hp": 45,
        "atk": 30,
        "def": 35,
        "spd": 45,
        "moves": [
            [
                "몸통박치기",
                40,
                "노말"
            ],
            [
                "실뿜기",
                0,
                "벌레"
            ],
            [
                "코골기",
                50,
                "노말"
            ],
            [
                "벌레먹음",
                60,
                "벌레"
            ]
        ]
    },
    "11": {
        "name": "단데기",
        "type": "벌레",
        "hp": 50,
        "atk": 20,
        "def": 55,
        "spd": 30,
        "moves": [
            [
                "실뿜기",
                0,
                "벌레"
            ],
            [
                "단단해지기",
                0,
                "노말"
            ],
            [
                "철벽",
                0,
                "강철"
            ],
            [
                "벌레먹음",
                60,
                "벌레"
            ]
        ]
    },
    "12": {
        "name": "버터플",
        "type": "벌레",
        "hp": 60,
        "atk": 45,
        "def": 50,
        "spd": 70,
        "moves": [
            [
                "칼바람",
                80,
                "노말"
            ],
            [
                "바람일으키기",
                40,
                "비행"
            ],
            [
                "날려버리기",
                0,
                "노말"
            ],
            [
                "박치기",
                70,
                "노말"
            ]
        ]
    },
    "13": {
        "name": "뿔충이",
        "type": "벌레",
        "hp": 40,
        "atk": 35,
        "def": 30,
        "spd": 50,
        "moves": [
            [
                "독침",
                15,
                "독"
            ],
            [
                "실뿜기",
                0,
                "벌레"
            ],
            [
                "벌레먹음",
                60,
                "벌레"
            ],
            [
                "일렉트릭네트",
                55,
                "전기"
            ]
        ]
    },
    "14": {
        "name": "딱충이",
        "type": "벌레",
        "hp": 45,
        "atk": 25,
        "def": 50,
        "spd": 35,
        "moves": [
            [
                "실뿜기",
                0,
                "벌레"
            ],
            [
                "단단해지기",
                0,
                "노말"
            ],
            [
                "철벽",
                0,
                "강철"
            ],
            [
                "벌레먹음",
                60,
                "벌레"
            ]
        ]
    },
    "15": {
        "name": "독침붕",
        "type": "벌레",
        "hp": 65,
        "atk": 90,
        "def": 40,
        "spd": 75,
        "moves": [
            [
                "칼춤",
                0,
                "노말"
            ],
            [
                "풀베기",
                50,
                "노말"
            ],
            [
                "박치기",
                70,
                "노말"
            ],
            [
                "마구찌르기",
                15,
                "노말"
            ]
        ]
    },
    "16": {
        "name": "구구",
        "type": "노말",
        "hp": 40,
        "atk": 45,
        "def": 40,
        "spd": 56,
        "moves": [
            [
                "칼바람",
                80,
                "노말"
            ],
            [
                "바람일으키기",
                40,
                "비행"
            ],
            [
                "날개치기",
                60,
                "비행"
            ],
            [
                "날려버리기",
                0,
                "노말"
            ]
        ]
    },
    "17": {
        "name": "피죤",
        "type": "노말",
        "hp": 63,
        "atk": 60,
        "def": 55,
        "spd": 71,
        "moves": [
            [
                "칼바람",
                80,
                "노말"
            ],
            [
                "바람일으키기",
                40,
                "비행"
            ],
            [
                "날개치기",
                60,
                "비행"
            ],
            [
                "날려버리기",
                0,
                "노말"
            ]
        ]
    },
    "18": {
        "name": "피죤투",
        "type": "노말",
        "hp": 83,
        "atk": 80,
        "def": 75,
        "spd": 101,
        "moves": [
            [
                "칼바람",
                80,
                "노말"
            ],
            [
                "바람일으키기",
                40,
                "비행"
            ],
            [
                "날개치기",
                60,
                "비행"
            ],
            [
                "날려버리기",
                0,
                "노말"
            ]
        ]
    },
    "19": {
        "name": "꼬렛",
        "type": "노말",
        "hp": 30,
        "atk": 56,
        "def": 35,
        "spd": 72,
        "moves": [
            [
                "풀베기",
                50,
                "노말"
            ],
            [
                "박치기",
                70,
                "노말"
            ],
            [
                "몸통박치기",
                40,
                "노말"
            ],
            [
                "누르기",
                85,
                "노말"
            ]
        ]
    },
    "20": {
        "name": "레트라",
        "type": "노말",
        "hp": 55,
        "atk": 81,
        "def": 60,
        "spd": 97,
        "moves": [
            [
                "칼춤",
                0,
                "노말"
            ],
            [
                "풀베기",
                50,
                "노말"
            ],
            [
                "박치기",
                70,
                "노말"
            ],
            [
                "몸통박치기",
                40,
                "노말"
            ]
        ]
    },
    "21": {
        "name": "깨비참",
        "type": "노말",
        "hp": 40,
        "atk": 60,
        "def": 30,
        "spd": 70,
        "moves": [
            [
                "칼바람",
                80,
                "노말"
            ],
            [
                "날개치기",
                60,
                "비행"
            ],
            [
                "날려버리기",
                0,
                "노말"
            ],
            [
                "공중날기",
                90,
                "비행"
            ]
        ]
    },
    "22": {
        "name": "깨비드릴조",
        "type": "노말",
        "hp": 65,
        "atk": 90,
        "def": 65,
        "spd": 100,
        "moves": [
            [
                "칼바람",
                80,
                "노말"
            ],
            [
                "날개치기",
                60,
                "비행"
            ],
            [
                "날려버리기",
                0,
                "노말"
            ],
            [
                "공중날기",
                90,
                "비행"
            ]
        ]
    },
    "23": {
        "name": "아보",
        "type": "독",
        "hp": 35,
        "atk": 60,
        "def": 44,
        "spd": 55,
        "moves": [
            [
                "조이기",
                15,
                "노말"
            ],
            [
                "힘껏치기",
                80,
                "노말"
            ],
            [
                "박치기",
                70,
                "노말"
            ],
            [
                "누르기",
                85,
                "노말"
            ]
        ]
    },
    "24": {
        "name": "아보크",
        "type": "독",
        "hp": 60,
        "atk": 95,
        "def": 69,
        "spd": 80,
        "moves": [
            [
                "조이기",
                15,
                "노말"
            ],
            [
                "힘껏치기",
                80,
                "노말"
            ],
            [
                "박치기",
                70,
                "노말"
            ],
            [
                "누르기",
                85,
                "노말"
            ]
        ]
    },
    "25": {
        "name": "피카츄",
        "type": "전기",
        "hp": 35,
        "atk": 55,
        "def": 40,
        "spd": 90,
        "moves": [
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "고양이돈받기",
                40,
                "노말"
            ],
            [
                "번개펀치",
                75,
                "전기"
            ],
            [
                "힘껏치기",
                80,
                "노말"
            ]
        ]
    },
    "26": {
        "name": "라이츄",
        "type": "전기",
        "hp": 60,
        "atk": 90,
        "def": 55,
        "spd": 110,
        "moves": [
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "고양이돈받기",
                40,
                "노말"
            ],
            [
                "번개펀치",
                75,
                "전기"
            ],
            [
                "힘껏치기",
                80,
                "노말"
            ]
        ]
    },
    "27": {
        "name": "모래두지",
        "type": "땅",
        "hp": 50,
        "atk": 75,
        "def": 85,
        "spd": 40,
        "moves": [
            [
                "할퀴기",
                40,
                "노말"
            ],
            [
                "칼춤",
                0,
                "노말"
            ],
            [
                "풀베기",
                50,
                "노말"
            ],
            [
                "모래뿌리기",
                0,
                "땅"
            ]
        ]
    },
    "28": {
        "name": "고지",
        "type": "땅",
        "hp": 75,
        "atk": 100,
        "def": 110,
        "spd": 65,
        "moves": [
            [
                "할퀴기",
                40,
                "노말"
            ],
            [
                "칼춤",
                0,
                "노말"
            ],
            [
                "풀베기",
                50,
                "노말"
            ],
            [
                "모래뿌리기",
                0,
                "땅"
            ]
        ]
    },
    "29": {
        "name": "니드런♀",
        "type": "독",
        "hp": 55,
        "atk": 47,
        "def": 52,
        "spd": 41,
        "moves": [
            [
                "할퀴기",
                40,
                "노말"
            ],
            [
                "풀베기",
                50,
                "노말"
            ],
            [
                "두번치기",
                30,
                "격투"
            ],
            [
                "박치기",
                70,
                "노말"
            ]
        ]
    },
    "30": {
        "name": "니드리나",
        "type": "독",
        "hp": 70,
        "atk": 62,
        "def": 67,
        "spd": 56,
        "moves": [
            [
                "할퀴기",
                40,
                "노말"
            ],
            [
                "풀베기",
                50,
                "노말"
            ],
            [
                "두번치기",
                30,
                "격투"
            ],
            [
                "박치기",
                70,
                "노말"
            ]
        ]
    },
    "31": {
        "name": "니드퀸",
        "type": "독",
        "hp": 90,
        "atk": 92,
        "def": 87,
        "spd": 76,
        "moves": [
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "고양이돈받기",
                40,
                "노말"
            ],
            [
                "불꽃펀치",
                75,
                "불꽃"
            ],
            [
                "냉동펀치",
                75,
                "얼음"
            ]
        ]
    },
    "32": {
        "name": "니드런♂",
        "type": "독",
        "hp": 46,
        "atk": 57,
        "def": 40,
        "spd": 50,
        "moves": [
            [
                "풀베기",
                50,
                "노말"
            ],
            [
                "두번치기",
                30,
                "격투"
            ],
            [
                "박치기",
                70,
                "노말"
            ],
            [
                "뿔찌르기",
                65,
                "노말"
            ]
        ]
    },
    "33": {
        "name": "니드리노",
        "type": "독",
        "hp": 61,
        "atk": 72,
        "def": 57,
        "spd": 65,
        "moves": [
            [
                "풀베기",
                50,
                "노말"
            ],
            [
                "두번치기",
                30,
                "격투"
            ],
            [
                "박치기",
                70,
                "노말"
            ],
            [
                "뿔찌르기",
                65,
                "노말"
            ]
        ]
    },
    "34": {
        "name": "니드킹",
        "type": "독",
        "hp": 81,
        "atk": 102,
        "def": 77,
        "spd": 85,
        "moves": [
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "고양이돈받기",
                40,
                "노말"
            ],
            [
                "불꽃펀치",
                75,
                "불꽃"
            ],
            [
                "냉동펀치",
                75,
                "얼음"
            ]
        ]
    },
    "35": {
        "name": "삐삐",
        "type": "페어리",
        "hp": 70,
        "atk": 45,
        "def": 48,
        "spd": 35,
        "moves": [
            [
                "막치기",
                40,
                "노말"
            ],
            [
                "연속뺨치기",
                15,
                "노말"
            ],
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "불꽃펀치",
                75,
                "불꽃"
            ]
        ]
    },
    "36": {
        "name": "픽시",
        "type": "페어리",
        "hp": 95,
        "atk": 70,
        "def": 73,
        "spd": 60,
        "moves": [
            [
                "막치기",
                40,
                "노말"
            ],
            [
                "연속뺨치기",
                15,
                "노말"
            ],
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "불꽃펀치",
                75,
                "불꽃"
            ]
        ]
    },
    "37": {
        "name": "식스테일",
        "type": "불꽃",
        "hp": 38,
        "atk": 41,
        "def": 40,
        "spd": 65,
        "moves": [
            [
                "박치기",
                70,
                "노말"
            ],
            [
                "몸통박치기",
                40,
                "노말"
            ],
            [
                "누르기",
                85,
                "노말"
            ],
            [
                "돌진",
                90,
                "노말"
            ]
        ]
    },
    "38": {
        "name": "나인테일",
        "type": "불꽃",
        "hp": 73,
        "atk": 76,
        "def": 75,
        "spd": 100,
        "moves": [
            [
                "박치기",
                70,
                "노말"
            ],
            [
                "몸통박치기",
                40,
                "노말"
            ],
            [
                "누르기",
                85,
                "노말"
            ],
            [
                "돌진",
                90,
                "노말"
            ]
        ]
    },
    "39": {
        "name": "푸린",
        "type": "노말",
        "hp": 115,
        "atk": 45,
        "def": 20,
        "spd": 20,
        "moves": [
            [
                "막치기",
                40,
                "노말"
            ],
            [
                "연속뺨치기",
                15,
                "노말"
            ],
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "불꽃펀치",
                75,
                "불꽃"
            ]
        ]
    },
    "40": {
        "name": "푸크린",
        "type": "노말",
        "hp": 140,
        "atk": 70,
        "def": 45,
        "spd": 45,
        "moves": [
            [
                "막치기",
                40,
                "노말"
            ],
            [
                "연속뺨치기",
                15,
                "노말"
            ],
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "불꽃펀치",
                75,
                "불꽃"
            ]
        ]
    },
    "41": {
        "name": "주뱃",
        "type": "독",
        "hp": 40,
        "atk": 45,
        "def": 35,
        "spd": 55,
        "moves": [
            [
                "칼바람",
                80,
                "노말"
            ],
            [
                "바람일으키기",
                40,
                "비행"
            ],
            [
                "날개치기",
                60,
                "비행"
            ],
            [
                "날려버리기",
                0,
                "노말"
            ]
        ]
    },
    "42": {
        "name": "골뱃",
        "type": "독",
        "hp": 75,
        "atk": 80,
        "def": 70,
        "spd": 90,
        "moves": [
            [
                "칼바람",
                80,
                "노말"
            ],
            [
                "바람일으키기",
                40,
                "비행"
            ],
            [
                "날개치기",
                60,
                "비행"
            ],
            [
                "날려버리기",
                0,
                "노말"
            ]
        ]
    },
    "43": {
        "name": "뚜벅쵸",
        "type": "풀",
        "hp": 45,
        "atk": 50,
        "def": 55,
        "spd": 30,
        "moves": [
            [
                "칼춤",
                0,
                "노말"
            ],
            [
                "풀베기",
                50,
                "노말"
            ],
            [
                "박치기",
                70,
                "노말"
            ],
            [
                "돌진",
                90,
                "노말"
            ]
        ]
    },
    "44": {
        "name": "냄새꼬",
        "type": "풀",
        "hp": 60,
        "atk": 65,
        "def": 70,
        "spd": 40,
        "moves": [
            [
                "칼춤",
                0,
                "노말"
            ],
            [
                "풀베기",
                50,
                "노말"
            ],
            [
                "박치기",
                70,
                "노말"
            ],
            [
                "돌진",
                90,
                "노말"
            ]
        ]
    },
    "45": {
        "name": "라플레시아",
        "type": "풀",
        "hp": 75,
        "atk": 80,
        "def": 85,
        "spd": 50,
        "moves": [
            [
                "칼춤",
                0,
                "노말"
            ],
            [
                "풀베기",
                50,
                "노말"
            ],
            [
                "박치기",
                70,
                "노말"
            ],
            [
                "누르기",
                85,
                "노말"
            ]
        ]
    },
    "46": {
        "name": "파라스",
        "type": "벌레",
        "hp": 35,
        "atk": 70,
        "def": 55,
        "spd": 25,
        "moves": [
            [
                "할퀴기",
                40,
                "노말"
            ],
            [
                "칼춤",
                0,
                "노말"
            ],
            [
                "풀베기",
                50,
                "노말"
            ],
            [
                "박치기",
                70,
                "노말"
            ]
        ]
    },
    "47": {
        "name": "파라섹트",
        "type": "벌레",
        "hp": 60,
        "atk": 95,
        "def": 80,
        "spd": 30,
        "moves": [
            [
                "할퀴기",
                40,
                "노말"
            ],
            [
                "칼춤",
                0,
                "노말"
            ],
            [
                "풀베기",
                50,
                "노말"
            ],
            [
                "박치기",
                70,
                "노말"
            ]
        ]
    },
    "48": {
        "name": "콘팡",
        "type": "벌레",
        "hp": 60,
        "atk": 55,
        "def": 50,
        "spd": 45,
        "moves": [
            [
                "박치기",
                70,
                "노말"
            ],
            [
                "몸통박치기",
                40,
                "노말"
            ],
            [
                "돌진",
                90,
                "노말"
            ],
            [
                "이판사판태클",
                120,
                "노말"
            ]
        ]
    },
    "49": {
        "name": "도나리",
        "type": "벌레",
        "hp": 70,
        "atk": 65,
        "def": 60,
        "spd": 90,
        "moves": [
            [
                "칼바람",
                80,
                "노말"
            ],
            [
                "바람일으키기",
                40,
                "비행"
            ],
            [
                "날려버리기",
                0,
                "노말"
            ],
            [
                "박치기",
                70,
                "노말"
            ]
        ]
    },
    "50": {
        "name": "디그다",
        "type": "땅",
        "hp": 10,
        "atk": 55,
        "def": 25,
        "spd": 95,
        "moves": [
            [
                "할퀴기",
                40,
                "노말"
            ],
            [
                "칼춤",
                0,
                "노말"
            ],
            [
                "풀베기",
                50,
                "노말"
            ],
            [
                "모래뿌리기",
                0,
                "땅"
            ]
        ]
    },
    "51": {
        "name": "닥트리오",
        "type": "땅",
        "hp": 35,
        "atk": 100,
        "def": 50,
        "spd": 120,
        "moves": [
            [
                "할퀴기",
                40,
                "노말"
            ],
            [
                "칼춤",
                0,
                "노말"
            ],
            [
                "풀베기",
                50,
                "노말"
            ],
            [
                "모래뿌리기",
                0,
                "땅"
            ]
        ]
    },
    "52": {
        "name": "나옹",
        "type": "노말",
        "hp": 40,
        "atk": 45,
        "def": 35,
        "spd": 90,
        "moves": [
            [
                "고양이돈받기",
                40,
                "노말"
            ],
            [
                "할퀴기",
                40,
                "노말"
            ],
            [
                "풀베기",
                50,
                "노말"
            ],
            [
                "박치기",
                70,
                "노말"
            ]
        ]
    },
    "53": {
        "name": "페르시온",
        "type": "노말",
        "hp": 65,
        "atk": 70,
        "def": 60,
        "spd": 115,
        "moves": [
            [
                "고양이돈받기",
                40,
                "노말"
            ],
            [
                "할퀴기",
                40,
                "노말"
            ],
            [
                "풀베기",
                50,
                "노말"
            ],
            [
                "박치기",
                70,
                "노말"
            ]
        ]
    },
    "54": {
        "name": "고라파덕",
        "type": "물",
        "hp": 50,
        "atk": 52,
        "def": 48,
        "spd": 55,
        "moves": [
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "고양이돈받기",
                40,
                "노말"
            ],
            [
                "냉동펀치",
                75,
                "얼음"
            ],
            [
                "할퀴기",
                40,
                "노말"
            ]
        ]
    },
    "55": {
        "name": "골덕",
        "type": "물",
        "hp": 80,
        "atk": 82,
        "def": 78,
        "spd": 85,
        "moves": [
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "고양이돈받기",
                40,
                "노말"
            ],
            [
                "냉동펀치",
                75,
                "얼음"
            ],
            [
                "할퀴기",
                40,
                "노말"
            ]
        ]
    },
    "56": {
        "name": "망키",
        "type": "격투",
        "hp": 40,
        "atk": 80,
        "def": 35,
        "spd": 70,
        "moves": [
            [
                "태권당수",
                50,
                "격투"
            ],
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "고양이돈받기",
                40,
                "노말"
            ],
            [
                "불꽃펀치",
                75,
                "불꽃"
            ]
        ]
    },
    "57": {
        "name": "성원숭",
        "type": "격투",
        "hp": 65,
        "atk": 105,
        "def": 60,
        "spd": 95,
        "moves": [
            [
                "태권당수",
                50,
                "격투"
            ],
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "고양이돈받기",
                40,
                "노말"
            ],
            [
                "불꽃펀치",
                75,
                "불꽃"
            ]
        ]
    },
    "58": {
        "name": "가디",
        "type": "불꽃",
        "hp": 55,
        "atk": 70,
        "def": 45,
        "spd": 60,
        "moves": [
            [
                "두번치기",
                30,
                "격투"
            ],
            [
                "박치기",
                70,
                "노말"
            ],
            [
                "누르기",
                85,
                "노말"
            ],
            [
                "돌진",
                90,
                "노말"
            ]
        ]
    },
    "59": {
        "name": "윈디",
        "type": "불꽃",
        "hp": 90,
        "atk": 110,
        "def": 80,
        "spd": 95,
        "moves": [
            [
                "박치기",
                70,
                "노말"
            ],
            [
                "누르기",
                85,
                "노말"
            ],
            [
                "돌진",
                90,
                "노말"
            ],
            [
                "이판사판태클",
                120,
                "노말"
            ]
        ]
    },
    "60": {
        "name": "발챙이",
        "type": "물",
        "hp": 40,
        "atk": 50,
        "def": 40,
        "spd": 90,
        "moves": [
            [
                "막치기",
                40,
                "노말"
            ],
            [
                "연속뺨치기",
                15,
                "노말"
            ],
            [
                "박치기",
                70,
                "노말"
            ],
            [
                "누르기",
                85,
                "노말"
            ]
        ]
    },
    "61": {
        "name": "슈륙챙이",
        "type": "물",
        "hp": 65,
        "atk": 65,
        "def": 65,
        "spd": 90,
        "moves": [
            [
                "막치기",
                40,
                "노말"
            ],
            [
                "연속뺨치기",
                15,
                "노말"
            ],
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "냉동펀치",
                75,
                "얼음"
            ]
        ]
    },
    "62": {
        "name": "강챙이",
        "type": "물",
        "hp": 90,
        "atk": 95,
        "def": 95,
        "spd": 70,
        "moves": [
            [
                "막치기",
                40,
                "노말"
            ],
            [
                "연속뺨치기",
                15,
                "노말"
            ],
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "냉동펀치",
                75,
                "얼음"
            ]
        ]
    },
    "63": {
        "name": "캐이시",
        "type": "에스퍼",
        "hp": 25,
        "atk": 20,
        "def": 15,
        "spd": 90,
        "moves": [
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "불꽃펀치",
                75,
                "불꽃"
            ],
            [
                "냉동펀치",
                75,
                "얼음"
            ],
            [
                "번개펀치",
                75,
                "전기"
            ]
        ]
    },
    "64": {
        "name": "윤겔라",
        "type": "에스퍼",
        "hp": 40,
        "atk": 35,
        "def": 30,
        "spd": 105,
        "moves": [
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "불꽃펀치",
                75,
                "불꽃"
            ],
            [
                "냉동펀치",
                75,
                "얼음"
            ],
            [
                "번개펀치",
                75,
                "전기"
            ]
        ]
    },
    "65": {
        "name": "후딘",
        "type": "에스퍼",
        "hp": 55,
        "atk": 50,
        "def": 45,
        "spd": 120,
        "moves": [
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "불꽃펀치",
                75,
                "불꽃"
            ],
            [
                "냉동펀치",
                75,
                "얼음"
            ],
            [
                "번개펀치",
                75,
                "전기"
            ]
        ]
    },
    "66": {
        "name": "알통몬",
        "type": "격투",
        "hp": 70,
        "atk": 80,
        "def": 50,
        "spd": 35,
        "moves": [
            [
                "태권당수",
                50,
                "격투"
            ],
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "불꽃펀치",
                75,
                "불꽃"
            ],
            [
                "냉동펀치",
                75,
                "얼음"
            ]
        ]
    },
    "67": {
        "name": "근육몬",
        "type": "격투",
        "hp": 80,
        "atk": 100,
        "def": 70,
        "spd": 45,
        "moves": [
            [
                "태권당수",
                50,
                "격투"
            ],
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "불꽃펀치",
                75,
                "불꽃"
            ],
            [
                "냉동펀치",
                75,
                "얼음"
            ]
        ]
    },
    "68": {
        "name": "괴력몬",
        "type": "격투",
        "hp": 90,
        "atk": 130,
        "def": 80,
        "spd": 55,
        "moves": [
            [
                "태권당수",
                50,
                "격투"
            ],
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "불꽃펀치",
                75,
                "불꽃"
            ],
            [
                "냉동펀치",
                75,
                "얼음"
            ]
        ]
    },
    "69": {
        "name": "모다피",
        "type": "풀",
        "hp": 50,
        "atk": 75,
        "def": 35,
        "spd": 40,
        "moves": [
            [
                "칼춤",
                0,
                "노말"
            ],
            [
                "풀베기",
                50,
                "노말"
            ],
            [
                "조이기",
                15,
                "노말"
            ],
            [
                "힘껏치기",
                80,
                "노말"
            ]
        ]
    },
    "70": {
        "name": "우츠동",
        "type": "풀",
        "hp": 65,
        "atk": 90,
        "def": 50,
        "spd": 55,
        "moves": [
            [
                "칼춤",
                0,
                "노말"
            ],
            [
                "풀베기",
                50,
                "노말"
            ],
            [
                "조이기",
                15,
                "노말"
            ],
            [
                "힘껏치기",
                80,
                "노말"
            ]
        ]
    },
    "71": {
        "name": "우츠보트",
        "type": "풀",
        "hp": 80,
        "atk": 105,
        "def": 65,
        "spd": 70,
        "moves": [
            [
                "칼춤",
                0,
                "노말"
            ],
            [
                "풀베기",
                50,
                "노말"
            ],
            [
                "조이기",
                15,
                "노말"
            ],
            [
                "힘껏치기",
                80,
                "노말"
            ]
        ]
    },
    "72": {
        "name": "왕눈해",
        "type": "물",
        "hp": 40,
        "atk": 40,
        "def": 35,
        "spd": 70,
        "moves": [
            [
                "칼춤",
                0,
                "노말"
            ],
            [
                "풀베기",
                50,
                "노말"
            ],
            [
                "조이기",
                15,
                "노말"
            ],
            [
                "박치기",
                70,
                "노말"
            ]
        ]
    },
    "73": {
        "name": "독파리",
        "type": "물",
        "hp": 80,
        "atk": 70,
        "def": 65,
        "spd": 100,
        "moves": [
            [
                "칼춤",
                0,
                "노말"
            ],
            [
                "풀베기",
                50,
                "노말"
            ],
            [
                "조이기",
                15,
                "노말"
            ],
            [
                "박치기",
                70,
                "노말"
            ]
        ]
    },
    "74": {
        "name": "꼬마돌",
        "type": "바위",
        "hp": 40,
        "atk": 80,
        "def": 100,
        "spd": 20,
        "moves": [
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "불꽃펀치",
                75,
                "불꽃"
            ],
            [
                "번개펀치",
                75,
                "전기"
            ],
            [
                "모래뿌리기",
                0,
                "땅"
            ]
        ]
    },
    "75": {
        "name": "데구리",
        "type": "바위",
        "hp": 55,
        "atk": 95,
        "def": 115,
        "spd": 35,
        "moves": [
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "불꽃펀치",
                75,
                "불꽃"
            ],
            [
                "번개펀치",
                75,
                "전기"
            ],
            [
                "모래뿌리기",
                0,
                "땅"
            ]
        ]
    },
    "76": {
        "name": "딱구리",
        "type": "바위",
        "hp": 80,
        "atk": 120,
        "def": 130,
        "spd": 45,
        "moves": [
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "불꽃펀치",
                75,
                "불꽃"
            ],
            [
                "번개펀치",
                75,
                "전기"
            ],
            [
                "메가톤킥",
                120,
                "노말"
            ]
        ]
    },
    "77": {
        "name": "포니타",
        "type": "불꽃",
        "hp": 50,
        "atk": 85,
        "def": 55,
        "spd": 90,
        "moves": [
            [
                "짓밟기",
                65,
                "노말"
            ],
            [
                "두번치기",
                30,
                "격투"
            ],
            [
                "박치기",
                70,
                "노말"
            ],
            [
                "뿔드릴",
                0,
                "노말"
            ]
        ]
    },
    "78": {
        "name": "날쌩마",
        "type": "불꽃",
        "hp": 65,
        "atk": 100,
        "def": 70,
        "spd": 105,
        "moves": [
            [
                "고양이돈받기",
                40,
                "노말"
            ],
            [
                "칼춤",
                0,
                "노말"
            ],
            [
                "짓밟기",
                65,
                "노말"
            ],
            [
                "두번치기",
                30,
                "격투"
            ]
        ]
    },
    "79": {
        "name": "야돈",
        "type": "물",
        "hp": 90,
        "atk": 65,
        "def": 65,
        "spd": 15,
        "moves": [
            [
                "고양이돈받기",
                40,
                "노말"
            ],
            [
                "짓밟기",
                65,
                "노말"
            ],
            [
                "박치기",
                70,
                "노말"
            ],
            [
                "몸통박치기",
                40,
                "노말"
            ]
        ]
    },
    "80": {
        "name": "야도란",
        "type": "물",
        "hp": 95,
        "atk": 75,
        "def": 110,
        "spd": 30,
        "moves": [
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "고양이돈받기",
                40,
                "노말"
            ],
            [
                "냉동펀치",
                75,
                "얼음"
            ],
            [
                "짓밟기",
                65,
                "노말"
            ]
        ]
    },
    "81": {
        "name": "코일",
        "type": "전기",
        "hp": 25,
        "atk": 35,
        "def": 70,
        "spd": 45,
        "moves": [
            [
                "박치기",
                70,
                "노말"
            ],
            [
                "몸통박치기",
                40,
                "노말"
            ],
            [
                "돌진",
                90,
                "노말"
            ],
            [
                "이판사판태클",
                120,
                "노말"
            ]
        ]
    },
    "82": {
        "name": "레어코일",
        "type": "전기",
        "hp": 50,
        "atk": 60,
        "def": 95,
        "spd": 70,
        "moves": [
            [
                "박치기",
                70,
                "노말"
            ],
            [
                "몸통박치기",
                40,
                "노말"
            ],
            [
                "돌진",
                90,
                "노말"
            ],
            [
                "이판사판태클",
                120,
                "노말"
            ]
        ]
    },
    "83": {
        "name": "파오리",
        "type": "노말",
        "hp": 52,
        "atk": 90,
        "def": 55,
        "spd": 60,
        "moves": [
            [
                "칼바람",
                80,
                "노말"
            ],
            [
                "칼춤",
                0,
                "노말"
            ],
            [
                "풀베기",
                50,
                "노말"
            ],
            [
                "바람일으키기",
                40,
                "비행"
            ]
        ]
    },
    "84": {
        "name": "두두",
        "type": "노말",
        "hp": 35,
        "atk": 85,
        "def": 45,
        "spd": 75,
        "moves": [
            [
                "칼춤",
                0,
                "노말"
            ],
            [
                "날개치기",
                60,
                "비행"
            ],
            [
                "날려버리기",
                0,
                "노말"
            ],
            [
                "공중날기",
                90,
                "비행"
            ]
        ]
    },
    "85": {
        "name": "두트리오",
        "type": "노말",
        "hp": 60,
        "atk": 110,
        "def": 70,
        "spd": 110,
        "moves": [
            [
                "칼춤",
                0,
                "노말"
            ],
            [
                "날개치기",
                60,
                "비행"
            ],
            [
                "날려버리기",
                0,
                "노말"
            ],
            [
                "공중날기",
                90,
                "비행"
            ]
        ]
    },
    "86": {
        "name": "쥬쥬",
        "type": "물",
        "hp": 65,
        "atk": 45,
        "def": 55,
        "spd": 45,
        "moves": [
            [
                "고양이돈받기",
                40,
                "노말"
            ],
            [
                "힘껏치기",
                80,
                "노말"
            ],
            [
                "박치기",
                70,
                "노말"
            ],
            [
                "뿔드릴",
                0,
                "노말"
            ]
        ]
    },
    "87": {
        "name": "쥬레곤",
        "type": "물",
        "hp": 90,
        "atk": 70,
        "def": 80,
        "spd": 70,
        "moves": [
            [
                "고양이돈받기",
                40,
                "노말"
            ],
            [
                "박치기",
                70,
                "노말"
            ],
            [
                "뿔드릴",
                0,
                "노말"
            ],
            [
                "누르기",
                85,
                "노말"
            ]
        ]
    },
    "88": {
        "name": "질퍽이",
        "type": "독",
        "hp": 80,
        "atk": 80,
        "def": 50,
        "spd": 25,
        "moves": [
            [
                "막치기",
                40,
                "노말"
            ],
            [
                "불꽃펀치",
                75,
                "불꽃"
            ],
            [
                "냉동펀치",
                75,
                "얼음"
            ],
            [
                "번개펀치",
                75,
                "전기"
            ]
        ]
    },
    "89": {
        "name": "질뻐기",
        "type": "독",
        "hp": 105,
        "atk": 105,
        "def": 75,
        "spd": 50,
        "moves": [
            [
                "막치기",
                40,
                "노말"
            ],
            [
                "불꽃펀치",
                75,
                "불꽃"
            ],
            [
                "냉동펀치",
                75,
                "얼음"
            ],
            [
                "번개펀치",
                75,
                "전기"
            ]
        ]
    },
    "90": {
        "name": "셀러",
        "type": "물",
        "hp": 30,
        "atk": 65,
        "def": 100,
        "spd": 40,
        "moves": [
            [
                "박치기",
                70,
                "노말"
            ],
            [
                "몸통박치기",
                40,
                "노말"
            ],
            [
                "돌진",
                90,
                "노말"
            ],
            [
                "이판사판태클",
                120,
                "노말"
            ]
        ]
    },
    "91": {
        "name": "파르셀",
        "type": "물",
        "hp": 50,
        "atk": 95,
        "def": 180,
        "spd": 70,
        "moves": [
            [
                "박치기",
                70,
                "노말"
            ],
            [
                "몸통박치기",
                40,
                "노말"
            ],
            [
                "누르기",
                85,
                "노말"
            ],
            [
                "돌진",
                90,
                "노말"
            ]
        ]
    },
    "92": {
        "name": "고오스",
        "type": "고스트",
        "hp": 30,
        "atk": 35,
        "def": 30,
        "spd": 80,
        "moves": [
            [
                "불꽃펀치",
                75,
                "불꽃"
            ],
            [
                "냉동펀치",
                75,
                "얼음"
            ],
            [
                "번개펀치",
                75,
                "전기"
            ],
            [
                "박치기",
                70,
                "노말"
            ]
        ]
    },
    "93": {
        "name": "고우스트",
        "type": "고스트",
        "hp": 45,
        "atk": 50,
        "def": 45,
        "spd": 95,
        "moves": [
            [
                "불꽃펀치",
                75,
                "불꽃"
            ],
            [
                "냉동펀치",
                75,
                "얼음"
            ],
            [
                "번개펀치",
                75,
                "전기"
            ],
            [
                "박치기",
                70,
                "노말"
            ]
        ]
    },
    "94": {
        "name": "팬텀",
        "type": "고스트",
        "hp": 60,
        "atk": 65,
        "def": 60,
        "spd": 110,
        "moves": [
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "불꽃펀치",
                75,
                "불꽃"
            ],
            [
                "냉동펀치",
                75,
                "얼음"
            ],
            [
                "번개펀치",
                75,
                "전기"
            ]
        ]
    },
    "95": {
        "name": "롱스톤",
        "type": "바위",
        "hp": 35,
        "atk": 45,
        "def": 160,
        "spd": 70,
        "moves": [
            [
                "조이기",
                15,
                "노말"
            ],
            [
                "힘껏치기",
                80,
                "노말"
            ],
            [
                "박치기",
                70,
                "노말"
            ],
            [
                "몸통박치기",
                40,
                "노말"
            ]
        ]
    },
    "96": {
        "name": "슬리프",
        "type": "에스퍼",
        "hp": 60,
        "atk": 48,
        "def": 45,
        "spd": 42,
        "moves": [
            [
                "막치기",
                40,
                "노말"
            ],
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "불꽃펀치",
                75,
                "불꽃"
            ],
            [
                "냉동펀치",
                75,
                "얼음"
            ]
        ]
    },
    "97": {
        "name": "슬리퍼",
        "type": "에스퍼",
        "hp": 85,
        "atk": 73,
        "def": 70,
        "spd": 67,
        "moves": [
            [
                "막치기",
                40,
                "노말"
            ],
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "불꽃펀치",
                75,
                "불꽃"
            ],
            [
                "냉동펀치",
                75,
                "얼음"
            ]
        ]
    },
    "98": {
        "name": "크랩",
        "type": "물",
        "hp": 30,
        "atk": 105,
        "def": 90,
        "spd": 50,
        "moves": [
            [
                "찝기",
                55,
                "노말"
            ],
            [
                "가위자르기",
                0,
                "노말"
            ],
            [
                "칼춤",
                0,
                "노말"
            ],
            [
                "풀베기",
                50,
                "노말"
            ]
        ]
    },
    "99": {
        "name": "킹크랩",
        "type": "물",
        "hp": 55,
        "atk": 130,
        "def": 115,
        "spd": 75,
        "moves": [
            [
                "찝기",
                55,
                "노말"
            ],
            [
                "가위자르기",
                0,
                "노말"
            ],
            [
                "칼춤",
                0,
                "노말"
            ],
            [
                "풀베기",
                50,
                "노말"
            ]
        ]
    },
    "100": {
        "name": "찌리리공",
        "type": "전기",
        "hp": 40,
        "atk": 30,
        "def": 50,
        "spd": 100,
        "moves": [
            [
                "박치기",
                70,
                "노말"
            ],
            [
                "몸통박치기",
                40,
                "노말"
            ],
            [
                "돌진",
                90,
                "노말"
            ],
            [
                "이판사판태클",
                120,
                "노말"
            ]
        ]
    },
    "101": {
        "name": "붐볼",
        "type": "전기",
        "hp": 60,
        "atk": 50,
        "def": 70,
        "spd": 150,
        "moves": [
            [
                "박치기",
                70,
                "노말"
            ],
            [
                "몸통박치기",
                40,
                "노말"
            ],
            [
                "돌진",
                90,
                "노말"
            ],
            [
                "이판사판태클",
                120,
                "노말"
            ]
        ]
    },
    "102": {
        "name": "아라리",
        "type": "풀",
        "hp": 60,
        "atk": 40,
        "def": 80,
        "spd": 40,
        "moves": [
            [
                "칼춤",
                0,
                "노말"
            ],
            [
                "박치기",
                70,
                "노말"
            ],
            [
                "돌진",
                90,
                "노말"
            ],
            [
                "이판사판태클",
                120,
                "노말"
            ]
        ]
    },
    "103": {
        "name": "나시",
        "type": "풀",
        "hp": 95,
        "atk": 95,
        "def": 85,
        "spd": 55,
        "moves": [
            [
                "칼춤",
                0,
                "노말"
            ],
            [
                "짓밟기",
                65,
                "노말"
            ],
            [
                "박치기",
                70,
                "노말"
            ],
            [
                "누르기",
                85,
                "노말"
            ]
        ]
    },
    "104": {
        "name": "탕구리",
        "type": "땅",
        "hp": 50,
        "atk": 50,
        "def": 95,
        "spd": 35,
        "moves": [
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "불꽃펀치",
                75,
                "불꽃"
            ],
            [
                "번개펀치",
                75,
                "전기"
            ],
            [
                "칼춤",
                0,
                "노말"
            ]
        ]
    },
    "105": {
        "name": "텅구리",
        "type": "땅",
        "hp": 60,
        "atk": 80,
        "def": 110,
        "spd": 45,
        "moves": [
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "불꽃펀치",
                75,
                "불꽃"
            ],
            [
                "번개펀치",
                75,
                "전기"
            ],
            [
                "칼춤",
                0,
                "노말"
            ]
        ]
    },
    "106": {
        "name": "시라소몬",
        "type": "격투",
        "hp": 50,
        "atk": 120,
        "def": 53,
        "spd": 87,
        "moves": [
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "칼춤",
                0,
                "노말"
            ],
            [
                "두번치기",
                30,
                "격투"
            ],
            [
                "메가톤킥",
                120,
                "노말"
            ]
        ]
    },
    "107": {
        "name": "홍수몬",
        "type": "격투",
        "hp": 50,
        "atk": 105,
        "def": 79,
        "spd": 76,
        "moves": [
            [
                "연속펀치",
                18,
                "노말"
            ],
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "불꽃펀치",
                75,
                "불꽃"
            ],
            [
                "냉동펀치",
                75,
                "얼음"
            ]
        ]
    },
    "108": {
        "name": "내루미",
        "type": "노말",
        "hp": 90,
        "atk": 55,
        "def": 75,
        "spd": 30,
        "moves": [
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "불꽃펀치",
                75,
                "불꽃"
            ],
            [
                "냉동펀치",
                75,
                "얼음"
            ],
            [
                "번개펀치",
                75,
                "전기"
            ]
        ]
    },
    "109": {
        "name": "또가스",
        "type": "독",
        "hp": 40,
        "atk": 65,
        "def": 95,
        "spd": 35,
        "moves": [
            [
                "박치기",
                70,
                "노말"
            ],
            [
                "몸통박치기",
                40,
                "노말"
            ],
            [
                "누르기",
                85,
                "노말"
            ],
            [
                "돌진",
                90,
                "노말"
            ]
        ]
    },
    "110": {
        "name": "또도가스",
        "type": "독",
        "hp": 65,
        "atk": 90,
        "def": 120,
        "spd": 60,
        "moves": [
            [
                "박치기",
                70,
                "노말"
            ],
            [
                "몸통박치기",
                40,
                "노말"
            ],
            [
                "누르기",
                85,
                "노말"
            ],
            [
                "돌진",
                90,
                "노말"
            ]
        ]
    },
    "111": {
        "name": "뿔카노",
        "type": "땅",
        "hp": 80,
        "atk": 85,
        "def": 95,
        "spd": 25,
        "moves": [
            [
                "칼춤",
                0,
                "노말"
            ],
            [
                "짓밟기",
                65,
                "노말"
            ],
            [
                "모래뿌리기",
                0,
                "땅"
            ],
            [
                "박치기",
                70,
                "노말"
            ]
        ]
    },
    "112": {
        "name": "코뿌리",
        "type": "땅",
        "hp": 105,
        "atk": 130,
        "def": 120,
        "spd": 40,
        "moves": [
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "고양이돈받기",
                40,
                "노말"
            ],
            [
                "불꽃펀치",
                75,
                "불꽃"
            ],
            [
                "냉동펀치",
                75,
                "얼음"
            ]
        ]
    },
    "113": {
        "name": "럭키",
        "type": "노말",
        "hp": 250,
        "atk": 5,
        "def": 5,
        "spd": 50,
        "moves": [
            [
                "막치기",
                40,
                "노말"
            ],
            [
                "연속뺨치기",
                15,
                "노말"
            ],
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "불꽃펀치",
                75,
                "불꽃"
            ]
        ]
    },
    "114": {
        "name": "덩쿠리",
        "type": "풀",
        "hp": 65,
        "atk": 55,
        "def": 115,
        "spd": 60,
        "moves": [
            [
                "칼춤",
                0,
                "노말"
            ],
            [
                "풀베기",
                50,
                "노말"
            ],
            [
                "조이기",
                15,
                "노말"
            ],
            [
                "힘껏치기",
                80,
                "노말"
            ]
        ]
    },
    "115": {
        "name": "캥카",
        "type": "노말",
        "hp": 105,
        "atk": 95,
        "def": 80,
        "spd": 90,
        "moves": [
            [
                "막치기",
                40,
                "노말"
            ],
            [
                "연속펀치",
                18,
                "노말"
            ],
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "불꽃펀치",
                75,
                "불꽃"
            ]
        ]
    },
    "116": {
        "name": "쏘드라",
        "type": "물",
        "hp": 30,
        "atk": 40,
        "def": 70,
        "spd": 60,
        "moves": [
            [
                "칼바람",
                80,
                "노말"
            ],
            [
                "박치기",
                70,
                "노말"
            ],
            [
                "돌진",
                90,
                "노말"
            ],
            [
                "이판사판태클",
                120,
                "노말"
            ]
        ]
    },
    "117": {
        "name": "시드라",
        "type": "물",
        "hp": 55,
        "atk": 65,
        "def": 95,
        "spd": 85,
        "moves": [
            [
                "박치기",
                70,
                "노말"
            ],
            [
                "돌진",
                90,
                "노말"
            ],
            [
                "이판사판태클",
                120,
                "노말"
            ],
            [
                "째려보기",
                0,
                "노말"
            ]
        ]
    },
    "118": {
        "name": "콘치",
        "type": "물",
        "hp": 45,
        "atk": 67,
        "def": 60,
        "spd": 63,
        "moves": [
            [
                "칼춤",
                0,
                "노말"
            ],
            [
                "박치기",
                70,
                "노말"
            ],
            [
                "뿔찌르기",
                65,
                "노말"
            ],
            [
                "마구찌르기",
                15,
                "노말"
            ]
        ]
    },
    "119": {
        "name": "왕콘치",
        "type": "물",
        "hp": 80,
        "atk": 92,
        "def": 65,
        "spd": 68,
        "moves": [
            [
                "칼춤",
                0,
                "노말"
            ],
            [
                "박치기",
                70,
                "노말"
            ],
            [
                "뿔찌르기",
                65,
                "노말"
            ],
            [
                "마구찌르기",
                15,
                "노말"
            ]
        ]
    },
    "120": {
        "name": "별가사리",
        "type": "물",
        "hp": 30,
        "atk": 45,
        "def": 55,
        "spd": 85,
        "moves": [
            [
                "박치기",
                70,
                "노말"
            ],
            [
                "몸통박치기",
                40,
                "노말"
            ],
            [
                "돌진",
                90,
                "노말"
            ],
            [
                "이판사판태클",
                120,
                "노말"
            ]
        ]
    },
    "121": {
        "name": "아쿠스타",
        "type": "물",
        "hp": 60,
        "atk": 75,
        "def": 85,
        "spd": 115,
        "moves": [
            [
                "박치기",
                70,
                "노말"
            ],
            [
                "몸통박치기",
                40,
                "노말"
            ],
            [
                "돌진",
                90,
                "노말"
            ],
            [
                "이판사판태클",
                120,
                "노말"
            ]
        ]
    },
    "122": {
        "name": "마임맨",
        "type": "에스퍼",
        "hp": 40,
        "atk": 45,
        "def": 65,
        "spd": 90,
        "moves": [
            [
                "막치기",
                40,
                "노말"
            ],
            [
                "연속뺨치기",
                15,
                "노말"
            ],
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "불꽃펀치",
                75,
                "불꽃"
            ]
        ]
    },
    "123": {
        "name": "스라크",
        "type": "벌레",
        "hp": 70,
        "atk": 110,
        "def": 80,
        "spd": 105,
        "moves": [
            [
                "칼바람",
                80,
                "노말"
            ],
            [
                "칼춤",
                0,
                "노말"
            ],
            [
                "풀베기",
                50,
                "노말"
            ],
            [
                "날개치기",
                60,
                "비행"
            ]
        ]
    },
    "124": {
        "name": "루주라",
        "type": "얼음",
        "hp": 65,
        "atk": 50,
        "def": 35,
        "spd": 95,
        "moves": [
            [
                "막치기",
                40,
                "노말"
            ],
            [
                "연속뺨치기",
                15,
                "노말"
            ],
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "냉동펀치",
                75,
                "얼음"
            ]
        ]
    },
    "125": {
        "name": "에레브",
        "type": "전기",
        "hp": 65,
        "atk": 83,
        "def": 57,
        "spd": 105,
        "moves": [
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "불꽃펀치",
                75,
                "불꽃"
            ],
            [
                "냉동펀치",
                75,
                "얼음"
            ],
            [
                "번개펀치",
                75,
                "전기"
            ]
        ]
    },
    "126": {
        "name": "마그마",
        "type": "불꽃",
        "hp": 65,
        "atk": 95,
        "def": 57,
        "spd": 93,
        "moves": [
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "불꽃펀치",
                75,
                "불꽃"
            ],
            [
                "번개펀치",
                75,
                "전기"
            ],
            [
                "메가톤킥",
                120,
                "노말"
            ]
        ]
    },
    "127": {
        "name": "쁘사이저",
        "type": "벌레",
        "hp": 65,
        "atk": 125,
        "def": 100,
        "spd": 85,
        "moves": [
            [
                "찝기",
                55,
                "노말"
            ],
            [
                "가위자르기",
                0,
                "노말"
            ],
            [
                "칼춤",
                0,
                "노말"
            ],
            [
                "풀베기",
                50,
                "노말"
            ]
        ]
    },
    "128": {
        "name": "켄타로스",
        "type": "노말",
        "hp": 75,
        "atk": 100,
        "def": 95,
        "spd": 110,
        "moves": [
            [
                "짓밟기",
                65,
                "노말"
            ],
            [
                "박치기",
                70,
                "노말"
            ],
            [
                "뿔찌르기",
                65,
                "노말"
            ],
            [
                "뿔드릴",
                0,
                "노말"
            ]
        ]
    },
    "129": {
        "name": "잉어킹",
        "type": "물",
        "hp": 20,
        "atk": 10,
        "def": 55,
        "spd": 80,
        "moves": [
            [
                "몸통박치기",
                40,
                "노말"
            ],
            [
                "하이드로펌프",
                110,
                "물"
            ],
            [
                "튀어오르기",
                0,
                "노말"
            ],
            [
                "바둥바둥",
                0,
                "노말"
            ]
        ]
    },
    "130": {
        "name": "갸라도스",
        "type": "물",
        "hp": 95,
        "atk": 125,
        "def": 79,
        "spd": 81,
        "moves": [
            [
                "조이기",
                15,
                "노말"
            ],
            [
                "박치기",
                70,
                "노말"
            ],
            [
                "몸통박치기",
                40,
                "노말"
            ],
            [
                "누르기",
                85,
                "노말"
            ]
        ]
    },
    "131": {
        "name": "라프라스",
        "type": "물",
        "hp": 130,
        "atk": 85,
        "def": 80,
        "spd": 60,
        "moves": [
            [
                "박치기",
                70,
                "노말"
            ],
            [
                "뿔드릴",
                0,
                "노말"
            ],
            [
                "누르기",
                85,
                "노말"
            ],
            [
                "돌진",
                90,
                "노말"
            ]
        ]
    },
    "132": {
        "name": "메타몽",
        "type": "노말",
        "hp": 48,
        "atk": 48,
        "def": 48,
        "spd": 48,
        "moves": [
            [
                "변신",
                0,
                "노말"
            ]
        ]
    },
    "133": {
        "name": "이브이",
        "type": "노말",
        "hp": 55,
        "atk": 55,
        "def": 50,
        "spd": 55,
        "moves": [
            [
                "고양이돈받기",
                40,
                "노말"
            ],
            [
                "두번치기",
                30,
                "격투"
            ],
            [
                "모래뿌리기",
                0,
                "땅"
            ],
            [
                "박치기",
                70,
                "노말"
            ]
        ]
    },
    "134": {
        "name": "샤미드",
        "type": "물",
        "hp": 130,
        "atk": 65,
        "def": 60,
        "spd": 65,
        "moves": [
            [
                "고양이돈받기",
                40,
                "노말"
            ],
            [
                "두번치기",
                30,
                "격투"
            ],
            [
                "모래뿌리기",
                0,
                "땅"
            ],
            [
                "박치기",
                70,
                "노말"
            ]
        ]
    },
    "135": {
        "name": "쥬피썬더",
        "type": "전기",
        "hp": 65,
        "atk": 65,
        "def": 60,
        "spd": 130,
        "moves": [
            [
                "고양이돈받기",
                40,
                "노말"
            ],
            [
                "두번치기",
                30,
                "격투"
            ],
            [
                "모래뿌리기",
                0,
                "땅"
            ],
            [
                "박치기",
                70,
                "노말"
            ]
        ]
    },
    "136": {
        "name": "부스터",
        "type": "불꽃",
        "hp": 65,
        "atk": 130,
        "def": 60,
        "spd": 65,
        "moves": [
            [
                "고양이돈받기",
                40,
                "노말"
            ],
            [
                "두번치기",
                30,
                "격투"
            ],
            [
                "모래뿌리기",
                0,
                "땅"
            ],
            [
                "박치기",
                70,
                "노말"
            ]
        ]
    },
    "137": {
        "name": "폴리곤",
        "type": "노말",
        "hp": 65,
        "atk": 60,
        "def": 70,
        "spd": 40,
        "moves": [
            [
                "박치기",
                70,
                "노말"
            ],
            [
                "몸통박치기",
                40,
                "노말"
            ],
            [
                "돌진",
                90,
                "노말"
            ],
            [
                "이판사판태클",
                120,
                "노말"
            ]
        ]
    },
    "138": {
        "name": "암나이트",
        "type": "바위",
        "hp": 35,
        "atk": 40,
        "def": 100,
        "spd": 35,
        "moves": [
            [
                "조이기",
                15,
                "노말"
            ],
            [
                "힘껏치기",
                80,
                "노말"
            ],
            [
                "모래뿌리기",
                0,
                "땅"
            ],
            [
                "박치기",
                70,
                "노말"
            ]
        ]
    },
    "139": {
        "name": "암스타",
        "type": "바위",
        "hp": 70,
        "atk": 60,
        "def": 125,
        "spd": 55,
        "moves": [
            [
                "조이기",
                15,
                "노말"
            ],
            [
                "모래뿌리기",
                0,
                "땅"
            ],
            [
                "박치기",
                70,
                "노말"
            ],
            [
                "뿔찌르기",
                65,
                "노말"
            ]
        ]
    },
    "140": {
        "name": "투구",
        "type": "바위",
        "hp": 30,
        "atk": 80,
        "def": 90,
        "spd": 55,
        "moves": [
            [
                "할퀴기",
                40,
                "노말"
            ],
            [
                "모래뿌리기",
                0,
                "땅"
            ],
            [
                "박치기",
                70,
                "노말"
            ],
            [
                "누르기",
                85,
                "노말"
            ]
        ]
    },
    "141": {
        "name": "투구푸스",
        "type": "바위",
        "hp": 60,
        "atk": 115,
        "def": 105,
        "spd": 80,
        "moves": [
            [
                "할퀴기",
                40,
                "노말"
            ],
            [
                "칼바람",
                80,
                "노말"
            ],
            [
                "칼춤",
                0,
                "노말"
            ],
            [
                "풀베기",
                50,
                "노말"
            ]
        ]
    },
    "142": {
        "name": "프테라",
        "type": "바위",
        "hp": 80,
        "atk": 105,
        "def": 65,
        "spd": 130,
        "moves": [
            [
                "칼바람",
                80,
                "노말"
            ],
            [
                "날개치기",
                60,
                "비행"
            ],
            [
                "날려버리기",
                0,
                "노말"
            ],
            [
                "공중날기",
                90,
                "비행"
            ]
        ]
    },
    "143": {
        "name": "잠만보",
        "type": "노말",
        "hp": 160,
        "atk": 110,
        "def": 65,
        "spd": 30,
        "moves": [
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "고양이돈받기",
                40,
                "노말"
            ],
            [
                "불꽃펀치",
                75,
                "불꽃"
            ],
            [
                "냉동펀치",
                75,
                "얼음"
            ]
        ]
    },
    "144": {
        "name": "프리져",
        "type": "얼음",
        "hp": 90,
        "atk": 85,
        "def": 100,
        "spd": 85,
        "moves": [
            [
                "칼바람",
                80,
                "노말"
            ],
            [
                "바람일으키기",
                40,
                "비행"
            ],
            [
                "날려버리기",
                0,
                "노말"
            ],
            [
                "공중날기",
                90,
                "비행"
            ]
        ]
    },
    "145": {
        "name": "썬더",
        "type": "전기",
        "hp": 90,
        "atk": 90,
        "def": 85,
        "spd": 100,
        "moves": [
            [
                "칼바람",
                80,
                "노말"
            ],
            [
                "날려버리기",
                0,
                "노말"
            ],
            [
                "공중날기",
                90,
                "비행"
            ],
            [
                "박치기",
                70,
                "노말"
            ]
        ]
    },
    "146": {
        "name": "파이어",
        "type": "불꽃",
        "hp": 90,
        "atk": 100,
        "def": 90,
        "spd": 90,
        "moves": [
            [
                "칼바람",
                80,
                "노말"
            ],
            [
                "바람일으키기",
                40,
                "비행"
            ],
            [
                "날개치기",
                60,
                "비행"
            ],
            [
                "날려버리기",
                0,
                "노말"
            ]
        ]
    },
    "147": {
        "name": "미뇽",
        "type": "드래곤",
        "hp": 41,
        "atk": 64,
        "def": 45,
        "spd": 50,
        "moves": [
            [
                "조이기",
                15,
                "노말"
            ],
            [
                "힘껏치기",
                80,
                "노말"
            ],
            [
                "박치기",
                70,
                "노말"
            ],
            [
                "누르기",
                85,
                "노말"
            ]
        ]
    },
    "148": {
        "name": "신뇽",
        "type": "드래곤",
        "hp": 61,
        "atk": 84,
        "def": 65,
        "spd": 70,
        "moves": [
            [
                "조이기",
                15,
                "노말"
            ],
            [
                "힘껏치기",
                80,
                "노말"
            ],
            [
                "박치기",
                70,
                "노말"
            ],
            [
                "뿔드릴",
                0,
                "노말"
            ]
        ]
    },
    "149": {
        "name": "망나뇽",
        "type": "드래곤",
        "hp": 91,
        "atk": 134,
        "def": 95,
        "spd": 80,
        "moves": [
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "불꽃펀치",
                75,
                "불꽃"
            ],
            [
                "냉동펀치",
                75,
                "얼음"
            ],
            [
                "번개펀치",
                75,
                "전기"
            ]
        ]
    },
    "150": {
        "name": "뮤츠",
        "type": "에스퍼",
        "hp": 106,
        "atk": 110,
        "def": 90,
        "spd": 130,
        "moves": [
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "고양이돈받기",
                40,
                "노말"
            ],
            [
                "불꽃펀치",
                75,
                "불꽃"
            ],
            [
                "냉동펀치",
                75,
                "얼음"
            ]
        ]
    },
    "151": {
        "name": "뮤",
        "type": "에스퍼",
        "hp": 100,
        "atk": 100,
        "def": 100,
        "spd": 100,
        "moves": [
            [
                "막치기",
                40,
                "노말"
            ],
            [
                "메가톤펀치",
                80,
                "노말"
            ],
            [
                "고양이돈받기",
                40,
                "노말"
            ],
            [
                "불꽃펀치",
                75,
                "불꽃"
            ]
        ]
    }
}